# -*- org-confirm-babel-evaluate: nil -*-
#+TITLE: Maximum likelihood estimation
#+AUTHOR: HaiYing Wang

# #+begin_export html
# <meta http-equiv="refresh" content="10" >
# #+end_export

**** Solving the problem numerically
#+begin_src julia :session main :exports both :eval no
using Optim
l(p) = -3 * log(p) - 2 * log(1 -p)
res = optimize(l, 0, 1)
summary(res)
Optim.minimum(res)
Optim.minimizer(res)
#+end_src

#+RESULTS:
: 0.6000000004335264


